package util;

public class BotConstants {
    public static final String WELCOME_MESSAGE =
            "Компания «АйКарс» приветствует Вас!\n\n" +
                    "Мы занимаемся доставкой автомобилей из разных стран.\n" +
                    "Выберите страну:";

    public static final String JAPAN_WARNING =
            "⚠️ Внимание! В 🇯🇵 Японии авто с правым рулем. Выберите Корею или Китай для леворульных авто.";

    public static final String BRAND_MODEL_QUESTION =
            "Укажите марку и модель авто:";

    public static final String BUDGET_QUESTION =
            "Для подбора оптимального варианта, уточните, пожалуйста, \n" +
                    "планируемый бюджет на автомобиль (в рублях):";

    public static final String PHONE_QUESTION =
            "Введите номер телефона (7XXXXXXXXXX):";

    public static final String ORDER_COMPLETE_MESSAGE =
            "✅ Заказ оформлен! Связь с администратором: @i_cars_pro";

    public static final String CONTACT_ADMIN_MESSAGE =
            "Свяжитесь с администратором: @i_cars_pro";
}