package util;

public class BotConstants {
    public static final String WELCOME_MESSAGE =
            "Компания «АйКарс» приветствует Вас!\n\n" +
                    "Мы занимаемся доставкой ведущих мировых автопроизводителей, включая европейских, и стран Азии.\n" +
                    "Пожалуйста, выберите в меню страну, где хотите приобрести автомобиль:";

    public static final String JAPAN_WARNING =
            "⚠️ Внимание! В 🇯🇵 Японии авто с правым рулем. Выберите Корею или Китай для леворульных авто.";

    public static final String BRAND_MODEL_QUESTION =
            "Укажите марку и модель авто, если уже знаете, какой автомобиль Вам нужен. \n" +
                    "Или напишите Ваши пожелания и требования к автомобилю.";

    public static final String BUDGET_QUESTION =
            "Какую сумму (бюджет) Вы планируете выделить на покупку машины?";

    public static final String PHONE_QUESTION =
            "Введите номер телефона (7XXXXXXXXXX):";

    public static final String ORDER_COMPLETE_MESSAGE =
            "✅ Заказ оформлен! Связь с администратором: @i_cars_pro";

    public static final String CONTACT_ADMIN_MESSAGE =
            "Свяжитесь с администратором: @i_cars_pro";
}